[
    "Durring the course of this project I designed a campus safety app using the multi-OS development platform flutter. The homepage had several features such as links to PDF resources provided by the Mercer police department on how to handle specific situations, navigation buttons to other pages on the app which used a stateful drop down menu, and a panic button that when pressed autodialed the Mercer police. The second page of the app consisted of a campus map that used google API to find the location of the user as well as mark any emergency call boxes nearby. The third and least page held informational links that when clicked would reach out to google firebase to retrieve items such as the student handbook or to websites that contained other school policies.",
    "This project was an idea that came out of frustrations from working in the construction industry. The Device was designed to hook up directly to a garden hose and made use of a motor to spin up the roller to a high rate of speed within a pressurized water chamber. As water exited the chamber it was continuously monitored for a “clean” measurement in parts per million. When the sensor decided the water was clean it would automatically shut off the machine and play a ringtone to alert the user.",
    "The airflow controller was designed to simulate a sinusoidal breathing pattern with a default length of two seconds in and two seconds’ pause. The pattern was able to be adjusted by an end user via a set of knobs which varied the length and amplitude of the airflow.",
    "Throughout a 4 month period I used VHDL and a FPGA to design the components of a CPU such as a multiplexor, memory, and ALU culminating in the design of a CPU which output peices of text that had been saved in memory to an LCD screan based on binary inputs from 8 switches.",
    "While at MMM I have been responsible for all avenues of employee security training. I use various methods such as monthly tips and tricks emails about current events and scams, bi-monthly phishing tests, new hire training courses, remedial training courses and even bi-annual long form security culture surveys. Using these methods, I was able to reduce MMM’s phish prone percentage from almost 5% down to 1% in my first six months.",
    "Over an 8 month engagement with vendors and 3rd party engineers I worked to deploy a DPL solution and build out rules based on current retention policies and standards.",
    "Currently I am heading a $150k side-by-side upgrade project of the systems with plans for MMM to expand the upgraded system to other offices. This project will allow for the rollout of smart security features in our enviroment such as facial recognition, detection automation, event correlation and smart searching features."    
]
